1s/ERP/Conf/Documents/Лико_КартаСнятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_КартаСнятия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСнятия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыСнятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВОплату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыСнятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыСнятия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВинаПечатника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетВиныПечатника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прерывание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_КартаСнятия/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидСнятия) Тогда
			Сообщениие = Новый СообщениеПользователю;
			Сообщениие.Текст = "Не заполнено поле ""Вид снятия""";
			Сообщениие.Поле = "ВидСнятия";
			Сообщениие.ПутьКДанным = "Объект";
			Сообщениие.Сообщить();
			Отказ = Истина;
			Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЕстьВыпускНЗП()
	
	Если Объект.ВидСнятия = Перечисления.Лико_ВидыСнятия.НетВиныПечатника И ЗначениеЗаполнено(Объект.Заказ) И ЗначениеЗаполнено(Объект.НомерБланка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_БланкЭтапаВыпуск.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
		|ГДЕ
		|	Лико_БланкЭтапаВыпуск.Ссылка.Проведен
		|	И НЕ Лико_БланкЭтапаВыпуск.Ссылка.ПометкаУдаления
		|	И Лико_БланкЭтапаВыпуск.Ссылка.ЗаказПокупателя = &ЗаказКлиента
		|	И Лико_БланкЭтапаВыпуск.Ссылка.НомерБланка = &НомерБланка
		|	И Лико_БланкЭтапаВыпуск.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
		|	И Лико_БланкЭтапаВыпуск.Ссылка.НомерПроката = &НомерПроката
		|	И Лико_БланкЭтапаВыпуск.Ссылка.Сотрудник.ФизическоеЛицо = &Оператор";
		
		Запрос.УстановитьПараметр("ЗаказКлиента", Объект.Заказ);
		Запрос.УстановитьПараметр("НомерБланка", Объект.НомерБланка);
		Запрос.УстановитьПараметр("НомерПроката", Объект.НомерПроката);
		Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);
		Запрос.УстановитьПараметр("Оператор", Объект.Оператор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			ЕстьВыпускНЗП = Ложь;
		КонецЕсли;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЕстьВыпускНЗП = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСнятияПриИзменении(Элемент)
	ПроверитьЕстьВыпускНЗП();
	УстановитьДоступностьВремяВОплату();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьВремяВОплату()
	Если (НЕ ЕстьВыпускНЗП И Объект.ВидСнятия = ПредопределенноеЗначение("Перечисление.Лико_ВидыСнятия.НетВиныПечатника")) ИЛИ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ЗакрытиеОтгрузки") Тогда
		Элементы.ВремяВОплату.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ВремяВОплату.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ЗакрытиеОтгрузки") Тогда
		Элементы.Оператор.ТолькоПросмотр = Ложь;	
		Элементы.Заказ.ТолькоПросмотр = Ложь;	
		Элементы.НомерБланка.ТолькоПросмотр = Ложь;	
		Элементы.НомерПроката.ТолькоПросмотр = Ложь;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПроверитьЕстьВыпускНЗП();
		УстановитьДоступностьВремяВОплату();
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	ПроверитьЕстьВыпускНЗП();
КонецПроцедуры

&НаКлиенте
Процедура НомерБланкаПриИзменении(Элемент)
	ПроверитьЕстьВыпускНЗП();
КонецПроцедуры

&НаКлиенте
Процедура НомерПрокатаПриИзменении(Элемент)
	ПроверитьЕстьВыпускНЗП();
КонецПроцедуры                     

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
